БИТУправление_медицинским_центром_демо/src/Documents/УведомлениеОВыпускеГотовойПродукцииМДЛП/УведомлениеОВыпускеГотовойПродукцииМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОВыпускеГотовойПродукцииМДЛП</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОВыпускеГотовойПродукцииМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОрганизацииМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоДеятельности</name>
    <type>
      <types>CatalogRef.МестаДеятельностиМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ДокументыПодтвержденияСоответствияМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодтверждения</name>
    <type>
      <types>DefinedType.НомерДокументаМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>DefinedType.НомерДокументаМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторОрганизации</name>
    <type>
      <types>DefinedType.ИдентификаторСубъектаОбращенияМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПодтверждения</name>
    <type>
      <types>EnumRef.СостоянияПодтвержденияМДЛП</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НомераУпаковок</name>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерУпаковкиМДЛП</types>
      </type>
    </attributes>
    <attributes>
      <name>Отклонено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСостояниеПодтверждения</name>
      <type>
        <types>EnumRef.СостоянияПодтвержденияМДЛП</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТранспортныеУпаковки</name>
    <attributes>
      <name>НомерУпаковки</name>
      <type>
        <types>DefinedType.SSCC</types>
      </type>
    </attributes>
    <attributes>
      <name>Отклонено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСостояниеПодтверждения</name>
      <type>
        <types>EnumRef.СостоянияПодтвержденияМДЛП</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Enums/СтатусыУпаковокМДЛП/СтатусыУпаковокМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыУпаковокМДЛП</name>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>ВРезерве</name>
  </enumValues>
  <enumValues>
    <name>ВыбылаИзОборота</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетВыпуска</name>
  </enumValues>
  <enumValues>
    <name>ПереданаНаУничтожение</name>
  </enumValues>
  <enumValues>
    <name>КПоступлению</name>
  </enumValues>
  <enumValues>
    <name>ВУпаковке</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженВРФ</name>
  </enumValues>
  <enumValues>
    <name>ВвезенНаТерриториюРФ</name>
  </enumValues>
  <enumValues>
    <name>Задекларирована</name>
  </enumValues>
  <enumValues>
    <name>ПереданаДляМаркировкиВЗТК</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтгрузкиВРФ</name>
  </enumValues>
  <enumValues>
    <name>МаркированаВЗТК</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодтвержденияИмпортером</name>
  </enumValues>
  <enumValues>
    <name>ОборотПриостановлен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодтвержденияСменыСобственника</name>
  </enumValues>
  <enumValues>
    <name>Реэкспорт</name>
  </enumValues>
  <enumValues>
    <name>Перемаркирована</name>
  </enumValues>
  <enumValues>
    <name>Уничтожена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаСкладИзЗТК</name>
  </enumValues>
  <enumValues>
    <name>Эмитирована</name>
  </enumValues>
  <enumValues>
    <name>НеИспользована</name>
  </enumValues>
  <enumValues>
    <name>ВыбылаИзОборотаСОшибкой</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/УведомлениеОВыпускеГотовойПродукцииМДЛП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнтеграцияМДЛППереопределяемый.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СостояниеПодтверждения = Метаданные().Реквизиты.СостояниеПодтверждения.ЗначениеЗаполнения;
	НомераУпаковок.Очистить();
	ТранспортныеУпаковки.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Не ИнтеграцияМДЛП.ИспользоватьХарактеристикиНоменклатуры() Тогда
		НепроверяемыеРеквизиты.Добавить("Товары.Характеристика");
	КонецЕсли;
	
	Если Не ИнтеграцияМДЛП.ИспользоватьСерииНоменклатуры() Тогда
		НепроверяемыеРеквизиты.Добавить("Товары.Серия");
	КонецЕсли;
	
	ИнтеграцияМДЛП.ПроверитьЗаполнениеУпаковок(ЭтотОбъект, Отказ);
	
	ИнтеграцияМДЛППереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	ИнтеграцияМДЛП.ПроверитьВозможностьЗаписиУведомления(ЭтотОбъект, РежимЗаписи);
	
	ИнтеграцияМДЛП.УбратьНезначащиеСимволы(ЭтотОбъект, "НомерДокумента");
	
	ИнтеграцияМДЛППереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияМДЛП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтандартнаяОбработка = Истина;
	ИнтеграцияМДЛППереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ИнтеграцияМДЛП.ПараметрыОперацииИзмененияСтатусаУпаковок();
	ПараметрыОперации.ИсходныйСтатус = Перечисления.СтатусыУпаковокМДЛП.ОжидаетВыпуска;
	ПараметрыОперации.НовыйСтатус    = Перечисления.СтатусыУпаковокМДЛП.ВОбороте;
	ИнтеграцияМДЛП.ПровестиДокументПоРегиструУпаковок(Ссылка, ПараметрыОперации, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	СтандартнаяОбработка = Истина;
	ИнтеграцияМДЛППереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияМДЛП.ОтменитьРезерв(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
